In [1]:
import numpy as np
import pandas as pd

In [2]:
my_list = [10,20,30]
labels = ['a','b','c']
arr = np.array([10,20,30])
dict = {'a':10,'b':20,'c':30}

In [3]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data=my_list, index=labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [7]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [8]:
pd.Series(dict)

a    10
b    20
c    30
dtype: int64

## DataFrame

In [9]:
pd.DataFrame(np.random.rand(5,4),index='Abhiraj Abhishek Ajin Rohan Parita'.split(),columns='Roll Python html css'.split())

              Roll    Python      html       css
Abhiraj   0.185023  0.233262  0.298993  0.302783
Abhishek  0.920863  0.198498  0.932206  0.525046
Ajin      0.434899  0.596226  0.572263  0.827857
Rohan     0.864712  0.238685  0.770139  0.860170
Parita    0.555964  0.320088  0.460385  0.801402

### 1. Create 3 list: productId, Product Name, Product Price with 5 elements each. Add this element to create a DataFrame.

In [10]:
pdt_Id = [101,102,103,104,105]
pdt_Name = ['Phone','Laptop','Tablet','PC','Modem']
pdt_Price = [45000,75000,50000,170000,25000]
dict = {'Product ID':pdt_Id,'Product Price':pdt_Price}
pd.DataFrame(dict,index=pdt_Name)

        Product ID  Product Price
Phone          101          45000
Laptop         102          75000
Tablet         103          50000
PC             104         170000
Modem          105          25000

In [11]:
pd.DataFrame(list(zip(pdt_Id,pdt_Name,pdt_Price)),columns=['Product ID','Product Name','Product Price'])

   Product ID Product Name  Product Price
0         101        Phone          45000
1         102       Laptop          75000
2         103       Tablet          50000
3         104           PC         170000
4         105        Modem          25000

### 2. Extract one by one column and display seperately from above dataframe

In [12]:
df = pd.DataFrame(list(zip(pdt_Id,pdt_Name,pdt_Price)),columns=['Product ID','Product Name','Product Price'])
print(df['Product ID'],'\n')
print(df['Product Name'],'\n')
print(df['Product Price'])

0    101
1    102
2    103
3    104
4    105
Name: Product ID, dtype: int64

0     Phone
1    Laptop
2    Tablet
3        PC
4     Modem
Name: Product Name, dtype: object

0     45000
1     75000
2     50000
3    170000
4     25000
Name: Product Price, dtype: int64

### 3. Display seperately each and every row from an above dataframe (use loc function3)

In [13]:
print(df.loc[0],'\n')
print(df.loc[1],'\n')
print(df.loc[2],'\n')
print(df.loc[3],'\n')
print(df.loc[4])

Product ID         101
Product Name     Phone
Product Price    45000
Name: 0, dtype: object

Product ID          102
Product Name     Laptop
Product Price     75000
Name: 1, dtype: object

Product ID          103
Product Name     Tablet
Product Price     50000
Name: 2, dtype: object

Product ID          104
Product Name         PC
Product Price    170000
Name: 3, dtype: object

Product ID         105
Product Name     Modem
Product Price    25000
Name: 4, dtype: object

### 4. Display data name from 3 row using loc function

In [14]:
df.loc[3:6,['Product Name']]

  Product Name
3           PC
4        Modem

### 5. Display price located in 2 row using iloc ()

In [15]:
df.iloc[2,2]

50000

In [16]:
sal = pd.read_csv('Salaries.csv')

FileNotFoundError: [Errno 2] No such file or directory: 'Salaries.csv'

In [17]:
sal

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [18]:
sal.describe()

                  Id       TotalPay  TotalPayBenefits           Year  Notes
count  148654.000000  148654.000000     148654.000000  148654.000000    0.0
mean    74327.500000   74768.321972      93692.554811    2012.522643    NaN
std     42912.857795   50517.005274      62793.533483       1.117538    NaN
min         1.000000    -618.130000       -618.130000    2011.000000    NaN
25%     37164.250000   36168.995000      44065.650000    2012.000000    NaN
50%     74327.500000   71426.610000      92404.090000    2013.000000    NaN
75%    111490.750000  105839.135000     132876.450000    2014.000000    NaN
max    148654.000000  567595.430000     567595.430000    2014.000000    NaN

In [19]:
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [20]:
sal.tail()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [21]:
sal.shape

(148654, 13)

In [22]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

In [23]:
sal['BasePay']

0            167411.18
1            155966.02
2            212739.13
3              77916.0
4             134401.6
              ...
148649            0.00
148650    Not Provided
148651    Not Provided
148652    Not Provided
148653            0.00
Name: BasePay, Length: 148654, dtype: object

In [25]:
sal['TotalPay'].mean()

74768.321971703

### What is the job title of JOSEPH DRISCOLL? Note: use all caps

In [27]:
sal['JobTitle'].unique()

array(['GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY',
       'CAPTAIN III (POLICE DEPARTMENT)',
       'WIRE ROPE CABLE MAINTENANCE MECHANIC', ..., 'Conversion',
       'Cashier 3', 'Not provided'], dtype=object)

In [31]:
sal['EmployeeName'].unique()

array(['NATHANIEL FORD', 'GARY JIMENEZ', 'ALBERT PARDINI', ...,
       'Charlene D Mccully', 'Not provided', 'Joe Lopez'], dtype=object)

In [35]:
sal[sal['Id']==25]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
24,25,JOSEPH DRISCOLL,"CAPTAIN, FIRE SUPPRESSION",140546.86,97868.77,31909.28,NaN,270324.91,270324.91,2011,NaN,San Francisco,NaN

In [36]:
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object